# Welcome to our Jupyter notebook!

Jupyter notebook is an amazing open-source tool that allows you to share live code, notes, equations, etc. in an interactive fashion. "Jupyter" stands for Julia, Python, and R, but today supports even more programming languages than just these. For each cell, you can specify whether you want it to be code or Markdown. The code is written in Python. You can tell that we are now in a Python evironment because it says `Python 3` in the upper left-hand corner of the page.

Insert a cell below in Markdown:

write something

Insert cell below in code and run `print("Hello world")`

In [5]:
print("Hello world")

Hello world

**Important note:** Jupyter notebooks are sequential, which means that cells that contain code need to be run in order to work! So remember to hit "Run" for each cell as we are working through. For example, if we try to print the value of x before defining it, we will get an error:

In [6]:
print(x)

NameError: name 'x' is not defined

In [7]:
x = 100 + 3

In [8]:
print(x)

103

Okay let's start learning about pandas!

# Import modules that we'll need

To start, we'll load up a few modules with the `import` statement. When you load a module using import, all of the functions available are now accessible to you. Modules and import statements help programmers avoid naming conflicts because you can use short, straightforward names for functions and variables without worrying that they're already taken. Matlab does not have anything equivalent to Python's module system and therefore can be harder to read. add your own notes!

In [9]:
import sqlite3
import pandas as pd

# Getting and cleaning Data

### Download Data

Let's load the data up using the `read_csv` function from the Pandas package, which we've abbreviated as `pd`. By using `pd.read_csv`, we return what is called a pandas DataFrame. A DataFrame can be thought of as a 2D table, but the values within each of the columns must be the same datatype. For example, any entry in the Year column must be an integer, while an entry in the Cause column must be a string.

In [10]:
# Use a # to "comment out" anything in a code block - this is a nice way to take notes and document your code!

# Data sets available at https://catalog.data.gov/dataset
data = pd.read_csv('NCHS_-_Leading_Causes_of_Death__United_States.csv',',')

The first thing to do with our DataFrame is to look at the first few rows of the function using `head()`. We often do this just to confirm that we loaded the data correctly (that it has the correct column names).

In [11]:
# Look at data
data.head()

,Year,113 Cause Name,Cause Name,State,Deaths,Age-adjusted Death Rate
0,2012,"Nephritis, nephrotic syndrome and nephrosis (N...",Kidney disease,Vermont,21,2.6
1,2016,"Nephritis, nephrotic syndrome and nephrosis (N...",Kidney disease,Vermont,30,3.7
2,2013,"Nephritis, nephrotic syndrome and nephrosis (N...",Kidney disease,Vermont,30,3.8
3,2000,"Intentional self-harm (suicide) (*U03,X60-X84,...",Suicide,District of Columbia,23,3.8
4,2014,"Nephritis, nephrotic syndrome and nephrosis (N...",Kidney disease,Arizona,325,4.1

**It looks just like our csv file!**

### Clean Data

Data typically needs to be "cleaned" before it's ready to use. For example, for pandas and other frameworks, spaces in names and names that start with numbers will cause problems. We've used a custom function `clean_names` to clean up the names of the data columns of the dataframe.  The details of how this function works are not important, but you're welcome to look at the file `make_database.py` in the `Github` repo to get an idea of how this function works.

In [19]:
# add code here to clean data

In [20]:
# Look at data again after we have "cleaned" it
data.head()

,Year,113 Cause Name,Cause Name,State,Deaths,Age-adjusted Death Rate
0,2012,"Nephritis, nephrotic syndrome and nephrosis (N...",Kidney disease,Vermont,21,2.6
1,2016,"Nephritis, nephrotic syndrome and nephrosis (N...",Kidney disease,Vermont,30,3.7
2,2013,"Nephritis, nephrotic syndrome and nephrosis (N...",Kidney disease,Vermont,30,3.8
3,2000,"Intentional self-harm (suicide) (*U03,X60-X84,...",Suicide,District of Columbia,23,3.8
4,2014,"Nephritis, nephrotic syndrome and nephrosis (N...",Kidney disease,Arizona,325,4.1

### Explore the data using pandas

Instead of looking at the data in Excel, we can use methods properties within the pandas framework to describe basic features of our dataset (feel free to look at the pandas documentation on DataFrames if you are curious about the difference between a method and a property).

In [21]:
# Describe returns summary statistics on numerical variables
data.describe()

               Year        Deaths  Age-adjusted Death Rate
count  10296.000000  1.029600e+04             10296.000000
mean    2007.500000  1.536793e+04               128.037383
std        5.188379  1.121457e+05               224.381865
min     1999.000000  2.100000e+01                 2.600000
25%     2003.000000  6.060000e+02                19.200000
50%     2007.500000  1.704500e+03                35.800000
75%     2012.000000  5.678000e+03               153.025000
max     2016.000000  2.744248e+06              1087.300000

In [22]:
# What are the column names?
data.columns

Index(['Year', '113 Cause Name', 'Cause Name', 'State', 'Deaths',
       'Age-adjusted Death Rate'],
      dtype='object')

In [23]:
# How many rows and columns are there?
data.shape

(10296, 6)

Note that the convention here is (rows, columns)

# Querying the database

## Background

### About Relational Databases

Unlike an excel spreadsheet or a `pandas DataFrame`, data is typically spread across multiple tables in a relational
database. The process of spreading data across multiple tables is called `normalization`. Normalization reduces
redundancies in the database (making the normalized database more compact in terms of disk space), makes it easier
(and safer) to change the value of a cell in a database, and can optimize the queries (or searches).

### About SQLite

Most relational databaes require a separate server process. This means you have to access the server in order to interact with the relational database. Here we're using `SQLite`, which is a relational database which has similar features to relational databases requiring servers (such as `MySQL`, `Postgre SQL`, or `SQL Server`), but doesn't require a server and is essentially plug-and-play. Most importantly, SQLite uses similar query language to the other databases. The language used to query all of these databases is based upon `SQL`, or `Structured Query Language`. We will sometimes point out equivalent commands for MySQL.

### Using Python to Interact With Relational Databases

`sqlite3` is a module within python that allows you to interact with `SQLite` within the comfort of python. Alternatively, you could interact with SQLite through a command line interface, but python makes it easier to run, store, and alter your queries. The `sqlite3` module with establish a connection with the sqlite3 database and assign this connection to an object, which we are calling `connection`:
```python
connection = sqlite3.connect("my_database")
```
We will use a nice feature of `pandas` which allows us to run a query and load it as a dataframe after we've opened up a connection with the database:
```python
result_df = pd.read_sql_query("My SQLite Query", connection)
```
The `pd` is how we tell the `pandas` module that we are talking to it, and the `read_sql_query` is the command we're giving the `pandas` module, which tells `pandas` to use the connection we've given it (inside of the paretheses) to run the query we've also given it, and ultimately to load the results of the query into a dataframe. Notice that I have to type the name of the dataframe at the end of the code block to see the results of the query. Finally, it is important to remember to close the database when you're done querying it, which you do by telling the connection to close:
```python
connection.close()
```
Lastly, do not worry if everything you just read sounded like gobble-dee-muck.  It's sufficient to just think of the commands as a series of spells that will work if you say them in the proper order.

## Getting to Know Your Database

One of the first things you'll want to do with a database with which you're unfamiliar is find out the names of the
`tables` within the database.

In [26]:
connection = sqlite3.connect("leading_causes_of_death.sqlite")
result_df = pd.read_sql_query("SELECT name FROM sqlite_master WHERE type='table'", connection)
connection.close()
result_df

     name
0    Year
1   Cause
2   State
3  Deaths

So our column names are `Year`, `Cause`, `State`, and `Deaths`. Notice that I have to type the name of the dataframe at the end of the code block to see the results of the query.

_As an aside:_ Although hopefully the command we used might make a little more sense as you continue with this notebook, it is fairly esoteric. In MySQL the equivalent command is
```SQL
SHOW tables;
```

Next you'll want to find out what are the `column` names in each table. We will do that table-by-table below, starting with the `Year` table.

_As an aside_: In MySQL you can use the command
```SQL
DESCRIBE my_table;
```

### Year Table

In [27]:
connection = sqlite3.connect("leading_causes_of_death.sqlite")
result_df = pd.read_sql_query("SELECT * FROM Year LIMIT 5", connection)
connection.close()
result_df

   YearID  Year
0       1  1999
1       2  2000
2       3  2001
3       4  2002
4       5  2003

### Cause Table

In [28]:
connection = sqlite3.connect("leading_causes_of_death.sqlite")
result_df = pd.read_sql_query("SELECT * FROM Cause LIMIT 5", connection)
connection.close()
result_df

,CauseID,Cause_Name,Cause_Description
0,1,Kidney disease,"Nephritis, nephrotic syndrome and nephrosis (N..."
1,2,Suicide,"Intentional self-harm (suicide) (*U03,X60-X84,..."
2,3,Alzheimer's disease,Alzheimer's disease (G30)
3,4,Influenza and pneumonia,Influenza and pneumonia (J09-J18)
4,5,Diabetes,Diabetes mellitus (E10-E14)

### State Table

In [29]:
connection = sqlite3.connect("leading_causes_of_death.sqlite")
result_df = pd.read_sql_query("SELECT * FROM State LIMIT 5", connection)
connection.close()
result_df

   StateID       State
0        1     Alabama
1        2      Alaska
2        3     Arizona
3        4    Arkansas
4        5  California

### Deaths Table

In [30]:
connection = sqlite3.connect("leading_causes_of_death.sqlite")
result_df = pd.read_sql_query("SELECT * FROM Deaths LIMIT 5", connection)
connection.close()
result_df

   ID  YearID  CauseID  StateID  Deaths  Age_adjusted_Death_Rate
0   1      14        1       47      21                      2.6
1   2      14        1        9      44                      7.2
2   3      14        1        3     414                      5.7
3   4      14        1       42      58                      5.6
4   5      14        1       49     482                      6.6

## Comparison to Original DataFrame

Lets take a look at our original dataframe, which we can do by typing its name `data`. We're going to once again use the `head` method to not overwhelm ourselves with the full table.

In [31]:
data.head()

,Year,113 Cause Name,Cause Name,State,Deaths,Age-adjusted Death Rate
0,2012,"Nephritis, nephrotic syndrome and nephrosis (N...",Kidney disease,Vermont,21,2.6
1,2016,"Nephritis, nephrotic syndrome and nephrosis (N...",Kidney disease,Vermont,30,3.7
2,2013,"Nephritis, nephrotic syndrome and nephrosis (N...",Kidney disease,Vermont,30,3.8
3,2000,"Intentional self-harm (suicide) (*U03,X60-X84,...",Suicide,District of Columbia,23,3.8
4,2014,"Nephritis, nephrotic syndrome and nephrosis (N...",Kidney disease,Arizona,325,4.1

Comparing the original dataframe (which has a format identical to the `csv` file you earlier opened in `Excel` to the `Deaths` table, we see that the year, cause name, and state are recoded as numbers. This prevents Vermont from being stored in the database 1000's of times and instead a single number (47) is stored in the `Deaths` table. This is exactly what we meant by `normalization`: we've broken up the original table into several tables in order to store the data in a more efficient manner. We can figure out which state the number 47 refers to by looking in the `State` table. We can figure out which year the number 14 refers to by looking in the `Year` table. We can also figure out what cause of death the number 1 refers to by looking in the `Cause` table.

## Query Language Basics

Now we're going to introduce you to the SQLite query language. This will make some of the queries we ran in the section **Getting To Know Your Database** a little easier to understand, and we invite you to review that section after completing this one.

### The Select Statement

A very common SQL statement is the `SELECT` statement which allows you to select columns from a particular table:
```SQL
SELECT <ColumnName>
FROM <TableName>
```

In [32]:
# Select and view the Cause_Name column from the Cause table:

connection = sqlite3.connect("leading_causes_of_death.sqlite")
result_df = pd.read_sql_query("SELECT Cause_Name FROM Cause", connection)
connection.close()
result_df

                 Cause_Name
0            Kidney disease
1                   Suicide
2       Alzheimer's disease
3   Influenza and pneumonia
4                  Diabetes
5                      CLRD
6    Unintentional injuries
7                    Stroke
8             Heart disease
9                    Cancer
10               All causes

### The Limit Statement

If you don't want to see all of the output you can add a `LIMIT` expression:
```SQL
SELECT <ColumnName>
FROM <TableName>
LIMIT <n>
```

In [34]:
# Limit the number of rows that display to 3:

connection = sqlite3.connect("leading_causes_of_death.sqlite")
result_df = pd.read_sql_query("SELECT Cause_Name FROM Cause LIMIT 3", connection)
connection.close()
result_df

            Cause_Name
0       Kidney disease
1              Suicide
2  Alzheimer's disease

### Selecting Multiple or All Columns

One approach to selecting all columns is to type them out as a list:
```SQL
SELECT <ColumnName, ColumnName> 
FROM <TableName>
LIMIT <n>
```

In [35]:
# Select and display all columns from the Cause table:

connection = sqlite3.connect("leading_causes_of_death.sqlite")
result_df = pd.read_sql_query("SELECT Cause_Name, Cause_Description FROM Cause LIMIT 3", connection)
connection.close()
result_df

            Cause_Name                                  Cause_Description
0       Kidney disease  Nephritis, nephrotic syndrome and nephrosis (N...
1              Suicide  Intentional self-harm (suicide) (*U03,X60-X84,...
2  Alzheimer's disease                          Alzheimer's disease (G30)

However, an easier way to simply select all column names is with `*`, which is a wildcard character in multiple programming languages:

```SQL
SELECT * 
FROM <TableName>
LIMIT <n>
```

**Exercise**: Modify the query above so that you get the same result using `*` instead of the column names.

In [ ]:
# Answer exercise here

### The WHERE Statement

You can also specify a condition using a `WHERE` statement:
```SQL
SELECT <ColumnName>
FROM <TableName>
WHERE <condition>
```

In [37]:
# In the Cause table, display the Cause_Description where Cause_Name is CLRD:

connection = sqlite3.connect("leading_causes_of_death.sqlite")
result_df = pd.read_sql_query("SELECT Cause_Description FROM Cause WHERE Cause_Name = 'CLRD'", connection)
connection.close()
result_df

                              Cause_Description
0  Chronic lower respiratory diseases (J40-J47)

**Exercise**: What is the description of 'Unintentional injuries'?

In [38]:
# Answer exercise here

### Single Joins

If we preview at our Deaths table again:

In [39]:
connection = sqlite3.connect("leading_causes_of_death.sqlite")
result_df = pd.read_sql_query("SELECT * FROM Deaths LIMIT 5", connection)
connection.close()
result_df

   ID  YearID  CauseID  StateID  Deaths  Age_adjusted_Death_Rate
0   1      14        1       47      21                      2.6
1   2      14        1        9      44                      7.2
2   3      14        1        3     414                      5.7
3   4      14        1       42      58                      5.6
4   5      14        1       49     482                      6.6

What if we wanted to identify the year, cause, and state in the first row? We COULD use a series of `SELECT` and `WHERE` statements. For example, to identify what year the YearID 14 corresponds to:

In [40]:
connection = sqlite3.connect("leading_causes_of_death.sqlite")
result_df = pd.read_sql_query("SELECT Year FROM Year WHERE YearID = 14", connection)
connection.close()
result_df

   Year
0  2012

However, that was a lot of work, and you had to remember the primary key number of the YearID from the first row. That's not very efficient and prone to errors. Computers to the rescue! If you give your computer the right command, it will do all of this work for you. This is where can use `JOIN` statements!

## Now let's head back to our powerpoint for a quick intro on how to make more complex queries using database joins!

The `JOIN` statement begins with a `SELECT` statement:
```SQL
SELECT <Table_x.Column_x, Table_y.Column_y>
```
`Table_x.Column_x` means `Column_x` from `Table_x`, so we are telling the database to show us `Column_x` from `Table_x` and `Column_y` from `Table_y`. Now we will add the `JOIN` part:
```SQL
SELECT <Table_x.Column_x, Table_y.Column_y>
FROM <Table_x> 
INNER JOIN <Table_y>
ON <Table_x.Column_x> = <Table_y.Column_y>
```
The `FROM Table_x` is code for saying, starting from `Table_x`, and the `INNER JOIN Table_y ON Table_x.Column_x = Table_y.Column_y` means make a table that has all of the rows from `Table_x` and `Table_y` where `Column_x` and `Column_y` have identical values.

_Aside_: There are many types of `JOINS`, but `INNER JOIN` is one of the most common.

In [43]:
# Join the Deaths and State tables on StateID:

connection = sqlite3.connect("leading_causes_of_death.sqlite")

query = '''SELECT *
      FROM Deaths 
      INNER JOIN State
      ON Deaths.StateID = State.StateID
      LIMIT 5'''

result_df = pd.read_sql_query(query, connection)
connection.close()
result_df

,ID,YearID,CauseID,StateID,Deaths,Age_adjusted_Death_Rate,StateID,State
0,1,14,1,47,21,2.6,47,Vermont
1,2,14,1,9,44,7.2,9,District of Columbia
2,3,14,1,3,414,5.7,3,Arizona
3,4,14,1,42,58,5.6,42,South Dakota
4,5,14,1,49,482,6.6,49,Washington

The `INNER JOIN` combined the two tables.  It's now really easy to see that `StateID` number 47 refers to Vermont. Notice too that we assigned the query to a variable and gave that variable (`query`) as a a parameter to `pd.read_sql_query`. We also put `'''` around the query, which is a way of telling Python that we are writing out a query that we want to put on multiple lines. `SQLite` doesn't care if you break your query up into lines or not, but it sure makes things a lot easier to read! We could have used the command below and gotten exactly the same result:
```python
result_df = pd.read_sql_query("SELECT * FROM Deaths INNER JOIN State ON Deaths.StateID = State.StateID LIMIT 5", connection)
```

Let's repeat that query but this time only select the columns `State`, `Deaths`, and `Age_Adjusted_Death_Rate`.

In [48]:
connection = sqlite3.connect("leading_causes_of_death.sqlite")

query = '''SELECT State.State, Deaths.Deaths, Deaths.Age_Adjusted_Death_Rate
      FROM Deaths 
      INNER JOIN State
      ON Deaths.StateID = State.StateID
      LIMIT 5'''

result_df = pd.read_sql_query(query, connection)
connection.close()
result_df

                  State  Deaths  Age_adjusted_Death_Rate
0               Vermont      21                      2.6
1  District of Columbia      44                      7.2
2               Arizona     414                      5.7
3          South Dakota      58                      5.6
4            Washington     482                      6.6

**Exercise:** Repeat the above query, but this time create a table that contains `Year`, `Deaths`, and `Age_Adjusted_Death_Rate`

In [49]:
# Answer exercise here

### Multiple Joins

Single Joins are great, but we need `Year`, `State`, and `Cause` joined with `Deaths` to be able to turn `Deaths` into something that we can understand with just a glance.

In [51]:
connection = sqlite3.connect("leading_causes_of_death.sqlite")

query = '''SELECT Year.Year, State.State, Deaths.Deaths, Deaths.Age_Adjusted_Death_Rate
      FROM Deaths 
      INNER JOIN State
      ON Deaths.StateID = State.StateID
      INNER JOIN Year
      ON Deaths.YearID = Year.YearID
      LIMIT 5'''

result_df = pd.read_sql_query(query, connection)
connection.close()
result_df

   Year                 State  Deaths  Age_adjusted_Death_Rate
0  2012               Vermont      21                      2.6
1  2012  District of Columbia      44                      7.2
2  2012               Arizona     414                      5.7
3  2012          South Dakota      58                      5.6
4  2012            Washington     482                      6.6

**Exercise:** Repeat the above query, but this time create a table that contains `Year`, `State`, `Cause`, `Deaths`, and `Age_Adjusted_Death_Rate`

In [52]:
# Answer exercise here

### Joins with the WHERE Statement

We can add in a `WHERE` statement to select rows from the joined table that meet some condition.

In [56]:
# Join tables for the year 2014:

connection = sqlite3.connect("leading_causes_of_death.sqlite")

query = '''SELECT Year.Year, State.State, Cause.Cause_Name, Deaths.Deaths, Deaths.Age_Adjusted_Death_Rate
      FROM Deaths 
      INNER JOIN State
      ON Deaths.StateID = State.StateID
      INNER JOIN Year
      ON Deaths.YearID = Year.YearID
      INNER JOIN Cause
      ON Deaths.CauseID = Cause.CauseID
      WHERE YEAR = 2014
      LIMIT 5'''

result_df = pd.read_sql_query(query, connection)
connection.close()
result_df

   Year                 State      Cause_Name  Deaths  Age_adjusted_Death_Rate
0  2014               Vermont  Kidney disease      37                      4.5
1  2014  District of Columbia  Kidney disease      49                      8.0
2  2014               Arizona  Kidney disease     325                      4.1
3  2014          South Dakota  Kidney disease      72                      6.5
4  2014            Washington  Kidney disease     481                      6.2

### The AND Statement

We can also add in an `AND` statment in the `WHERE` statement to select rows that meet two conditions

In [57]:
# Join tables for "All causes" of death in 2014:

connection = sqlite3.connect("leading_causes_of_death.sqlite")

query = '''SELECT Year.Year, State.State, Cause.Cause_Name, Deaths.Deaths, Deaths.Age_Adjusted_Death_Rate
      FROM Deaths 
      INNER JOIN State
      ON Deaths.StateID = State.StateID
      INNER JOIN Year
      ON Deaths.YearID = Year.YearID
      INNER JOIN Cause
      ON Deaths.CauseID = Cause.CauseID
      WHERE Year = 2012 AND Cause_Name = 'All causes'
      LIMIT 5'''

result_df = pd.read_sql_query(query, connection)
connection.close()
result_df

   Year                 State  Cause_Name  Deaths  Age_adjusted_Death_Rate
0  2012               Vermont  All causes    5491                    700.1
1  2012  District of Columbia  All causes    4650                    757.2
2  2012               Arizona  All causes   49549                    682.9
3  2012          South Dakota  All causes    7333                    712.3
4  2012            Washington  All causes   50105                    681.5

### The ORDER BY Statement

The `ORDER BY` statement allows us to get results ordered by some column.  This makes it really easy to see the row with the highest of some value (or the lowest). The `ORDER BY` statement works like this:
```SQL
ORDER BY <ColumnA> ASC
```
This will give us a table that is sorted by ColumnA in ascending order. The statement below gives us the table sorted by ColumnA sorted in descending order.
```SQL
ORDER BY <ColumnA> DESC
```

In [58]:
# Order State in ascending order:

connection = sqlite3.connect("leading_causes_of_death.sqlite")

query = '''SELECT Year.Year, State.State, Cause.Cause_Name, Deaths.Deaths, Deaths.Age_Adjusted_Death_Rate
      FROM Deaths 
      INNER JOIN State
      ON Deaths.StateID = State.StateID
      INNER JOIN Year
      ON Deaths.YearID = Year.YearID
      INNER JOIN Cause
      ON Deaths.CauseID = Cause.CauseID
      WHERE YEAR = 2012 AND Cause_Name = 'All causes'
      ORDER BY State ASC
      LIMIT 5'''

result_df = pd.read_sql_query(query, connection)
connection.close()
result_df

   Year       State  Cause_Name  Deaths  Age_adjusted_Death_Rate
0  2012     Alabama  All causes   49301                    926.7
1  2012      Alaska  All causes    3912                    731.4
2  2012     Arizona  All causes   49549                    682.9
3  2012    Arkansas  All causes   30117                    897.5
4  2012  California  All causes  242554                    630.4

We've gotten the table in alphabetical order by State! Not very interesting! But you get the idea. You can use `ORDER BY` with both numerical and alphabetical variables. For a much more interesting example of the `ORDER BY` statement, check out the exercise below.

**Exercise**: Which state had the highest Age-Adjusted Death Rate in 2012? Which state had the lowest?

In [ ]:
# Answer exercise here

# Wrapping Up

We hope you enjoyed this introduction to using `python`, `pandas` and `SQLite`! Our intention was to give you an introduction to these powerful software tools and to instill you with the confidence that _you_ can learn to use them! If you'd like to get some more information, we've provided you with some links with helpful tutorials for you to continue your learning.

[SQLite Tutorial](https://www.tutorialspoint.com/sqlite)